In [1]:
import numpy as np
import pandas as pd

In [2]:
dict={
    "name":['rehan','saquib','minhaj','sayeka','sabiha'],
    "marks":[92,99,90,98,100],
    "city":['delhi','delhi','dehli','darbhanga','darbhanga']
}

In [3]:
df=pd.DataFrame(dict)
df

     name  marks       city
0   rehan     92      delhi
1  saquib     99      delhi
2  minhaj     90      dehli
3  sayeka     98  darbhanga
4  sabiha    100  darbhanga

In [4]:
df.to_csv("family.csv",index=False)

In [5]:
df.head(2)

     name  marks   city
0   rehan     92  delhi
1  saquib     99  delhi

In [6]:
df.tail(3)

     name  marks       city
2  minhaj     90      dehli
3  sayeka     98  darbhanga
4  sabiha    100  darbhanga

In [7]:
df.describe()

            marks
count    5.000000
mean    95.800000
std      4.494441
min     90.000000
25%     92.000000
50%     98.000000
75%     99.000000
max    100.000000

In [8]:
family=pd.read_csv("family.csv")
family

     name  marks       city
0   rehan     92      delhi
1  saquib     99      delhi
2  minhaj     90      dehli
3  sayeka     98  darbhanga
4  sabiha    100  darbhanga

In [9]:
family['marks'][2]=100
family

C:\Users\mdreh\AppData\Local\Temp\ipykernel_22052\2431040404.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  family['marks'][2]=100

     name  marks       city
0   rehan     92      delhi
1  saquib     99      delhi
2  minhaj    100      dehli
3  sayeka     98  darbhanga
4  sabiha    100  darbhanga

In [11]:
newDF=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [12]:
newDF.head()

          0         1         2         3         4
0  0.283385  0.300063  0.001296  0.567608  0.268261
1  0.477966  0.859201  0.888101  0.037864  0.618039
2  0.872680  0.972828  0.168981  0.946588  0.722583
3  0.747823  0.572820  0.382201  0.194789  0.779552
4  0.555621  0.079292  0.859889  0.585346  0.453027

In [13]:
type(newDF)

pandas.core.frame.DataFrame

In [14]:
newDF.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [16]:
newDF.columns

RangeIndex(start=0, stop=5, step=1)

In [25]:
newDF.sort_index(axis=1,ascending=False)
newDF

            0         1         2         3         4
0    0.283385  0.300063  0.001296  0.567608  0.268261
1    0.477966  0.859201  0.888101  0.037864  0.618039
2    0.872680  0.972828  0.168981  0.946588  0.722583
3    0.747823  0.572820  0.382201  0.194789  0.779552
4    0.555621  0.079292  0.859889  0.585346  0.453027
..        ...       ...       ...       ...       ...
329  0.198571  0.074263  0.440552  0.216701  0.880178
330  0.109998  0.442397  0.906400  0.849979  0.600725
331  0.430745  0.802962  0.481071  0.442954  0.853280
332  0.772945  0.865262  0.228560  0.774278  0.993967
333  0.417287  0.287558  0.446637  0.314862  0.258269

[334 rows x 5 columns]